#include <iostream>
int main()
{
	setlocale(LC_ALL, "Russian");

	//нужно инициализировать s1 s2


	//============ 1 вариант - нулем ============//
	//char* s1{};
	//char* s2{};
	//===========================================//


	//==== 2 вариант - объявить 2 переменные и присвоить их адреса указателям ====//
	char s1Num = 'a';
	char s2Num = 'b';
	char* s1{ &s1Num };
	char* s2{ &s2Num };
	//============================================================================//

	std::cout << "s1: 0x" << & s1 << std::endl;
	std::cout << "s2: 0x" << & s2 << std::endl;

	if (s1 == s2)
		std::cout << "равно";
	else
		std::cout << "не равно";
	

}